# MustBeInMainModel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..MustBeInMainModel Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
Element must be in Main Model
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MustBeInMainModel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MustBeInMainModel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MustBeInMainModel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace